//  ----------------------------------------------------------------------------
//  system const values
//  ----------------------------------------------------------------------------

/** システム アプリ名 */
export const APP_NAME = 'Links!'
/** システム デフォルトロケール */
export const LOCALE = 'ja'
/** システム モード */
export const APP_MODE = process.env.NODE_ENV
/** システム APIルートURL */
export const API_ROOT = process.env.API_ROOT

//  ----------------------------------------------------------------------------
//  general const values
//  ----------------------------------------------------------------------------

/** 日付 デフォルトフォーマット */
export const DATE_FORMAT = 'PP'
